vonKarman/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    patch;
        nFaces          318688;
        startFace       238562;
    }
    symmetry
    {
        type            symmetry;
        physicalType    patch;
        nFaces          430;
        startFace       557250;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          120;
        startFace       557680;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          120;
        startFace       557800;
    }
    walls
    {
        type            patch;
        physicalType    patch;
        nFaces          238;
        startFace       557920;
    }
)

// ************************************************************************* //
